{
    "profilePicture": "profile.png",
    "fullName": "Sobhan Fooladi Mahani",
    "title": "DATA ANALYSIS | R&D ENGINEER | PYTHON DEVELOPER",
    "contact": {
        "email": "fooladi.sobhan@outlook.com",
        "address": "Spain, Barcelona",
        "dob": "1996",
        "linkedin": "https://www.linkedin.com/in/sobhan-fooladi-71b407232/"
    },
    "objective": [
        "Master’s student in Deep Learning and Big Data at Universitat Politècnica de Catalunya with hands-onexperience in building data pipelines, deploying machine learning models, and developing backend systems.Delivered real-time EMG signal analysis tools with 94% classification accuracy and improved signalprocessing speed by 30%. Skilled in Python, Flask, and data visualization, with experience developingmicroservices and analytics dashboards. Passionate about combining research, development, and data-driven insights to solve real-world problems. Eager to contribute analytical thinking, technical expertise, andcreativity in a data analyst internship within a collaborative and impact-oriented environment."
    ],
    "experience": [
        {
            "position": "Backend Developer & R&D Engineer",
            "location": "Imaz Tech - Barcelona, Spain",
            "period": "Jul 2023 - Present",
            "responsibilities": [
                "Developed and maintained Flask-based APIs supporting ML pipelines for real-time data processing.",
                "Applied signal filtering techniques to improve EMG muscle activation accuracy by 30%",
                "Built AI-driven classification models for motion analysis (achieved 94% accuracy)",
                "Collaborated with frontend teams to implement data visualizations and system workflows",
                "Created a dedicated microservice for generating human exercise analytics reports."
            ]
        },
        {
            "position": "Software Engineer / Technical Product Owner",
            "location": "SaminCoin",
            "period": "Oct 2021 - Jan 2023",
            "responsibilities": [
                "Developed backend systems with Python and Django.",
                "Designed RESTful APIs for various applications.",
                "Troubleshot and optimized code with cross-functional teams.",
                "Used Git for version control and reviewed team code.",
                "Created UML models and collaborated with UI/UX teams."
            ]
        }
    ],
    "education": [
        "Master's in Telecommunications (MATT), UPC - Feb 2023 - Present",
        "Bachelor's in Information Technology, Azad University of Karaj - Sep 2015 - Aug 2020"
    ],
    "skills": [
        "Programming Languages: Python, Bash, JavaScript",
        "Data Analysis & Machine Learning: Pandas, NumPy, Scikit-learn, Matplotlib, OpenCV, MediaPipe",
        "Web Development & APIs: Flask, RESTful API design",
        "Tools & Platforms: Git, Linux, UML Modeling, Jupyter, VS Code",
        "Other: Document Workflow, Scenario Modeling, performance optimization, software architecture"
    ],
    "languages": [
        "English: Advanced, IELTS",
        "Spanish: Beginner",
        "Farsi: Native Language"
    ],
    "translations": {
        "contact": "Contact Information",
        "objective": "Professional Summary",
        "experience": "Experience",
        "education": "Education",
        "skills": "Skills",
        "languages": "Languages"
    }
}