{
    "profilePicture": "profile.png",
    "fullName": "Sobhan Fooladi Mahani",
    "title": "AI & DEEP LEARNING ENGINEER | ML RESEARCHER & R&D",
    "contact": {
        "email": "fooladi.sobhan@outlook.com",
        "address": "Barcelona, Spain",
        "dob": "1996",
        "linkedin": "https://www.linkedin.com/in/sobhan-fooladi-mahani",
        "github": "https://github.com/sobhan-fld"
    },
    "objective": [
        "AI & Deep Learning Engineer with experience building end-to-end ML systems, deploying multilingual LLM pipelines, and developing efficient deep learning models for real-world applications. Strong background in NLP/LLMs, PyTorch-based model development, and ML pipeline engineering across cloud and edge environments. Currently conducting master thesis research at CTTC on energy and performance profiling of deep learning models across heterogeneous hardware. Motivated to work in research, ML engineering, and R&D roles combining deep learning, efficiency, and practical deployment."
    ],
    "experience": [
        {
            "position": "Master Thesis Researcher – Sustainable AI (SAI) – Part time",
            "location": "CTTC – Centre Tecnològic de Telecomunicacions de Catalunya, Barcelona",
            "period": "Oct 2025 – Present",
            "responsibilities": [
                "Conducting research on energy-efficient deep learning, profiling training/inference costs and CO2 emissions across heterogeneous hardware (Jetson Nano, laptop GPUs, server nodes).",
                "Benchmarking CNN, LSTM/GRU, and contrastive learning models for image and time-series tasks under diverse training settings.",
                "Designing measurement campaigns using CodeCarbon and CarbonTracker to evaluate GPU/CPU/RAM usage and energy scaling behavior.",
                "Deploying models on edge devices to study runtime constraints, memory limits, and batch-size effects.",
                "Exploring optimization techniques (contrastive learning, reservoir computing, coreset selection) to reduce model training cost while maintaining accuracy.",
                "Developed an internal tool at CTTC to automate model training pipelines and track energy use/CO2 emissions during experiments. GitHub: https://github.com/sobhan-fld/SustainVision"
            ]
        },
        {
            "position": "AI & NLP Engineer (Freelance)",
            "location": "Moodest, Techno Campus, Mataró, Barcelona",
            "period": "Apr 2025 – Present",
            "responsibilities": [
                "Developed multilingual LLM and NLP pipelines (Catalan/Spanish/English) for workplace well-being and communication analytics.",
                "Hosted Llama 3.2 models on Hugging Face AWS Inference Endpoints and integrated them into Moodest’s production NLP pipeline with automated context handling and agent routing.",
                "Designed agent-based orchestration and context-management modules improving processing accuracy and reasoning reliability.",
                "Achieved 96% message filtering accuracy and 91% engagement-score prediction using transformer embeddings combined with XGBoost models.",
                "Built privacy-compliant preprocessing and production-ready REST APIs powering Moodest’s in-house AI services."
            ]
        },
        {
            "position": "AI & Backend Engineer (R&D – MAXSENS Project) – Full time",
            "location": "Imaz Tech – Barcelona, Spain",
            "period": "Aug 2023 – Aug 2025",
            "responsibilities": [
                "Developed Flask-based backend APIs for real-time EMG and motion data processing, enabling scalable modular AI pipelines.",
                "Built CNN and LSTM models achieving 94% gesture classification accuracy on high-dimensional physiological signals.",
                "Improved signal-processing efficiency by 30% through optimized filtering and feature extraction workflows.",
                "Automated analytics report generation (CSV, PDF, JPG), reducing manual handling by over 60%.",
                "Implemented posture and motion detection features that reduced exercise execution errors by 40%.",
                "Collaborated with clinical and product teams to align ML outputs with real-world use cases."
            ]
        },
        {
            "position": "Software Engineer & Technical Product Owner",
            "location": "SaminCoin – Tehran",
            "period": "Oct 2021 – Dec 2022",
            "responsibilities": [
                "Designed and maintained RESTful APIs in Python/Django for fraud detection and transaction classification on a cryptocurrency platform.",
                "Created detailed UML diagrams and system designs, improving cross-team communication and reducing development cycle times by 25%.",
                "Led product roadmap planning and sprint execution, contributing to a 40% reduction in time-to-market for key features.",
                "Worked closely with UI/UX teams to optimize onboarding workflows, improving early user experience and satisfaction.",
                "Introduced agile development practices and improved sprint visibility, enabling better prioritization and alignment across engineering and product teams."
            ]
        }
    ],
    "education": [
        "Master’s in Telecommunications – Deep Learning for Multimedia Processing Specialization, Universitat Politècnica de Catalunya (UPC), Barcelona – 2023 – 2025",
        "Bachelor’s in Information Technology Engineering, Azad University, Karaj – 2015 – 2020"
    ],
    "skills": [
        "Programming Languages: Python, Bash",
        "Deep Learning & Machine Learning: PyTorch, Scikit-learn, NumPy, Pandas, Matplotlib, CNNs, LSTMs/GRUs, transfer learning, contrastive learning, self-supervised learning, model evaluation",
        "NLP & LLMs: Hugging Face pipelines, multilingual LLM integration, Llama models, embeddings, text classification, sentiment and topic modeling",
        "Energy & Performance Profiling: CodeCarbon, GPU/CPU/RAM profiling, efficiency analysis across edge and server devices",
        "Backend & Infrastructure: Flask APIs, RESTful services, AWS Lambda/API Gateway/S3, Dockerized endpoints, Linux systems, microservice workflow design",
        "Tools & Platforms: Git, Linux, Jupyter, JetBrains IDEs (e.g., PyCharm), VS Code, Google Colab",
        "Concepts & Techniques: Deep learning, supervised and self-supervised learning, time-series analysis, model deployment, cloud deployment, model optimization, data pipelines, experimental design, reproducible workflows"
    ],
    "languages": [
        "English: Fluent",
        "Spanish: A1 – Beginner",
        "Farsi: Native"
    ],
    "additionalInfo": {
        "workAuthorization": "Eligible to work and intern in Spain",
        "portfolio": "https://sobhan-fld.github.io/cv/",
        "interests": "Deep learning research, LLM systems, efficient ML, edge AI, signal analysis, development and coding, creative prototyping, video games, reading mystery novels, tech philosophy, problem-solving challenges"
    },
    "translations": {
        "contact": "Contact Information",
        "objective": "Professional Summary",
        "experience": "Experience",
        "education": "Education",
        "skills": "Skills",
        "languages": "Languages"
    }
}
