{
    "profilePicture": "profile.png",
    "fullName": "Sobhan Fooladi Mahani",
    "title": "ANÁLISIS DE DATOS | INGENIERO I+D | DESARROLLADOR PYTHON",
    "contact": {
        "email": "fooladi.sobhan@outlook.com",
        "address": "España, Barcelona",
        "dob": "1996",
        "linkedin": "https://www.linkedin.com/in/sobhan-fooladi-71b407232/"
    },
    "objective": [
        "Estudiante de máster en Deep Learning y Big Data en la Universitat Politècnica de Catalunya con experiencia práctica en la construcción de pipelines de datos, despliegue de modelos de aprendizaje automático y desarrollo de sistemas backend. Desarrolló herramientas de análisis de señales EMG en tiempo real con un 94% de precisión en la clasificación y mejoró la velocidad de procesamiento de señales en un 30%. Hábil en Python, Flask y visualización de datos, con experiencia en el desarrollo de microservicios y paneles analíticos. Apasionado por combinar la investigación, el desarrollo y el análisis de datos para resolver problemas del mundo real. Con ganas de aportar pensamiento analítico, experiencia técnica y creatividad en una pasantía como analista de datos dentro de un entorno colaborativo y orientado al impacto."
    ],
    "experience": [
        {
            "position": "Desarrollador Backend e Ingeniero de I+D",
            "location": "Imaz Tech - Barcelona, España",
            "period": "Jul 2023 - Presente",
            "responsibilities": [
                "Desarrolló y mantuvo APIs basadas en Flask que soportan pipelines de ML para procesamiento de datos en tiempo real.",
                "Aplicó técnicas de filtrado de señales para mejorar la precisión de activación muscular EMG en un 30%.",
                "Construyó modelos de clasificación impulsados por IA para análisis de movimiento (logró un 94% de precisión).",
                "Colaboró con equipos frontend para implementar visualizaciones de datos y flujos de trabajo del sistema.",
                "Creó un microservicio dedicado a generar informes analíticos de ejercicios humanos."
            ]
        },
        {
            "position": "Ingeniero de Software / Product Owner Técnico",
            "location": "SaminCoin",
            "period": "Oct 2021 - Ene 2023",
            "responsibilities": [
                "Desarrolló sistemas backend con Python y Django.",
                "Diseñó APIs RESTful para diversas aplicaciones.",
                "Solucionó problemas y optimizó código junto a equipos multidisciplinarios.",
                "Usó Git para control de versiones y revisión de código del equipo.",
                "Creó modelos UML y colaboró con equipos de UI/UX."
            ]
        }
    ],
    "education": [
        "Máster en Telecomunicaciones (MATT), UPC - Feb 2023 - Presente",
        "Grado en Tecnologías de la Información, Universidad Azad de Karaj - Sep 2015 - Ago 2020"
    ],
    "skills": [
        "Lenguajes de Programación: Python, Bash, JavaScript",
        "Análisis de Datos y Aprendizaje Automático: Pandas, NumPy, Scikit-learn, Matplotlib, OpenCV, MediaPipe",
        "Desarrollo Web y APIs: Flask, diseño de API RESTful",
        "Herramientas y Plataformas: Git, Linux, Modelado UML, Jupyter, VS Code",
        "Otros: Flujo de trabajo de documentos, modelado de escenarios, optimización de rendimiento, arquitectura de software"
    ],
    "languages": [
        "Inglés: Avanzado, IELTS",
        "Español: Principiante",
        "Persa: Lengua materna"
    ],
    "translations": {
        "contact": "Información de Contacto",
        "objective": "Resumen Profesional",
        "experience": "Experiencia",
        "education": "Educación",
        "skills": "Habilidades",
        "languages": "Idiomas"
    }
}
